GTUEngineers/autonomous-vehicle-mcu/STM32_Codes/autonomousVehicle_GTU/Src/main.c
    /*Configure GPIO pin : BRAKE_RELAY_1_Pin */
    GPIO_InitStruct.Pin = BRAKE_RELAY_1_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
    HAL_GPIO_Init(BRAKE_RELAY_1_GPIO_Port, &GPIO_InitStruct);

    /*Configure GPIO pin : MEMS_INT2_Pin */
    GPIO_InitStruct.Pin = MEMS_INT2_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(MEMS_INT2_GPIO_Port, &GPIO_InitStruct);

    /* EXTI interrupt init*/
    HAL_NVIC_SetPriority(EXTI9_5_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);

}

/* USER CODE BEGIN 4 */
void HAL_TIM_PeriodElapsedCallback (TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM3)
    {
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_3);
        HAL_TIM_Base_Stop(&htim2);
        HAL_TIM_Base_Stop(&htim3);
        HAL_GPIO_WritePin(STEER_PWM_GPIO_Port, STEER_PWM_Pin, GPIO_PIN_RESET);

    }
    else if (htim->Instance == TIM4)
    {

        HAL_TIM_Base_Stop(&htim4);
        if (it_callback != NULL)
        {
            (*it_callback)( );
        }
    }
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask (void const * argument)
{
    
    /* USER CODE BEGIN 5 */
    /* Infinite loop */
#if DEBUG_LOG == 0

#endif

    for (;;)
    {
#if DEBUG_LOG == 0
        //set_green_led();
        //set_red_led();
        //set_orange_led();
        //set_blue_led();
        osDelay(3000);
        //brake_test( );
        throttle_test( );
        //steer_test( );
        //hcsr04( );
#endif
#if DEBUG_LOG
        _write(0, "Debug", 5);
        uart_message_req b;
        if (communication_get_msg(&b) == OK)
        {
            uart_message_rep a;
            uint16_t val;
            uint8_t val2;
            parse_steer_msg(&b, &val2, &val);
            sprintf(a.generic_msg.msg, "%d %d", val, val2);
            communication_send_msg(&a);
        }
        osDelay(1);
#endif
    }
    /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_ControlTask */
/**
 * @brief Function implementing the Control thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_ControlTask */
void ControlTask (void const * argument)
{
    /* USER CODE BEGIN ControlTask */
    /* Infinite loop */
    uart_message_req req;

    uint8_t msg_header;
    for (;;)
    {

        if (communication_get_msg(&req) == OK)
        {
            msg_header = (req.req.msg[0] & 0b11110000) >> 4;
            switch (msg_header)
            {
                case 0x0:
                {
                    uint8_t val = 0;
                    uart_message_rep rep = { 0 };
                    parse_startstop_msg(&req, &val);
                    is_started = val;
                    if (is_started == 1)
                    {
                        start_system( );
                    }
                    else
                    {
                        emergency_stop( );
                    }
                    create_general_rep_msg(&rep, 1);
                    communication_send_msg(&rep);
                    break;
                }
                case 0x1:
                {
                    if (is_started == 1)
                    {
                        uint8_t dir;
                        int16_t val;
                        uart_message_rep rep = { 0 };
                        parse_steer_msg(&req, &dir, &val);
                        if (dir == 0)
                        {
                            val = val * 7;
                        }
                        else
                        {
                            val = val * 7 * -1;
                        }
                        steer_set_value(val);
                        create_general_rep_msg(&rep, 1);
                        communication_send_msg(&rep);
                    }
                    break;
                }
                case 0x2:
                {
                    if (is_started == 1)
                    {
                        uint8_t val;
                        uart_message_rep rep = { 0 };
                        parse_throttle_msg(&req, &val);
                        switch (val)
                        {
                            case 0:
                            {
                                throttle_set_value(SPEED_0);
                                break;
                            }
                            case 5:
                            {
                                throttle_set_value(SPEED_5);
                                break;
                            }
                            case 8:
                            {
                                throttle_set_value(SPEED_8);
                                break;
                            }
                            case 10:
                            {
                                throttle_set_value(SPEED_10);
                                break;
                            }
                            case 13:
                            {
                                throttle_set_value(SPEED_13);
                                break;
                            }
                            case 15:
                            {
                                throttle_set_value(SPEED_15);
                                break;
                            }
                            case 20:
                            {
                                throttle_set_value(SPEED_20);
                                break;
                            }
                            default:
                            {
                                throttle_set_value(SPEED_0);
                                break;
                            }

