GTUEngineers/autonomous-vehicle-mcu/STM32_Codes/autonomousVehicle_GTU/Src/main.c
                        }
                        create_general_rep_msg(&rep, 1);
                        communication_send_msg(&rep);
                    }
                    break;
                }
                case 0x3:
                {
                    if (is_started == 1)
                    {
                        uint8_t val;
                        uart_message_rep rep = { 0 };
                        parse_brake_msg(&req, &val);
                        if (val == 0)
                        {
                            brake_set_value(BRAKE_RELEASE);
                        }
                        else
                        {
                            brake_set_value(BRAKE_LOCK);
                        }
                        create_general_rep_msg(&rep, 1);
                        communication_send_msg(&rep);
                    }
                    break;
                }
                case 0x4:
                {

                    break;
                }
                default:
                {
                    //LOGGER
                    break;
                }
            }
        }
        else
        {
        }

        osDelay(1);
    }
    /* USER CODE END ControlTask */
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler (void)
{
    /* USER CODE BEGIN Error_Handler_Debug */
    /* User can add his own implementation to report the HAL error return state */

    /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
